import React, { Component } from 'react';

import './france.css'

export default class France extends Component {

	render() {
		return (
			<section className='france'>
        <h2>Краткая история Франции</h2>
				В 21 веке везде ощущается влияние Франции; от культуры до науки, от военного искусства до архитектуры. Как росло французское
				государство? Какой исторически путь у этой западноевропейской страны, узнаем в статье. С перевода из латинского слово
				Франция-страна которая находится в Западной Европе.
				<h3>Древние времена</h3>
 				Еще 2 миллиона лет назад на этой территории жили люди, о чем свидетельствуют орудия труда и наскальные рисунки. Еще в железном
				веке территория нынешней Франции называлась Галлией, где соответственно жили галлы, которые происходили от кельтов, они же
				основали Литецию-современный Париж. Первый раз современную территорию франции завоевали греки, потом прешли римляне, под началом
				Цезаря, который и стал наместником Галлии. Под воздействиям римлян и греков создается новая культура; римска-галлская. В нынешнем
				Париже до сих пор можно найти следи римской империи. В 5 веке на Францию нападают варвары; германские франки и делают Париж
				столицей страны. В этом же веке руководитель варваров, Хлодвиг, принимает католицизм, соответственно и вся страна делает то же
				самое. Хлодвиг умирает в 511 году и сим же заканчивается династия Меровингов. На францию нападали вестготы, гунны, франки,
				алеманы и другие. С давних времен в это страну иммигрировали множество народов. Этот феномен продолжается до сих пор.
				<h3>Средние века</h3>
				В течении нескольких веков династии Каролингов и Капетингов правили государством Франция. Одним из лучших в династии Каролингов
				был Пипин Короткий, который прославился как дальновидны политик, гениальный стратег и воин. Он был в хороших отношениях с папой.
				При сыне Пипина, Карла Великого, Франция достигла своего апогея. Он сумел увеличить территорию Франции в несколько раз. Его
				реформы сделали из Франции одну из диктующих стран в средние века. Он централизовал власть. Сын Карла Великого так же придерживался
				курса своего великого отца. Но в 11 веке начались интриги и царство Каролингов распалась на несколько суверенных частей. На
				трон взошел аббат ГугоКапет, он же основал династию Капетингов. Во времена Капета начинаются религиозные войны. Приемник Капета,
				Вильгелм 1, подчиняет Англию. Другой король из Капетингов Филипп Август основал парижский университет, при нем начали строить
				лувр и продолжали строить Собор Парижской Богоматери. В конце 12-го века, благодаря росту экономики и централизованной власти,
				французом удается окончательно победить англичан и тем самым закончить объединение своих земель. Архитектура достигает апогея.
				Благодаря этому сегодня у мира есть Реймский собор и Терновый венец. Капетинги правили до середины 14-го века. Когда умер последний
				король Капетингов, за престолонаследие завязалась война между династиями Валуа и Плантагенетов. Не надо забывать, что во время их
				правления появились новые классы, такие как сеньоры, вассалы, феодалы. Так же они принимали участие в крестовых походах, ибо спасти
				Гроб Господни.
				<h3>Жанна Д'Арк</h3>
 				Это женщина занимает отдельное место в истории Франции. Во времена столетней войны против Англии (1337 г. – 1453 г.) под руководством
				Жанны Д'Арк (Орлеанская Дева) французская армия одержала грандиозную победу над англичанами. Но, как это часто бывает, страна
				быстро забыла о ее подвигах и сожгла ее как еретика. О ней снято множество фильмов. Тогда на французском троне сидел род Валуа.
				<h3>Людовики</h3>
 				Людовик 11 расширяет территорию страны почти в три раза, при нем расцветает искусство и наука, он же из крепости Бастилия делает
				знаменитую тюрьму. После него на троне сидит его сын Людовик 12 (1498-1515). Не мало интересен Генрих 2, который умер на рыцарском
				турнире на площади Вогезов. Внук Генриха Карл 9 втянул страну в религиозные войны; католики и протестанты начали резню друг против
				друга. За десять лет страна воевала десять раз. В 24 августа 1572 года произошла Варфоломеевская ночь, в этот день массово уничтожали
				гугенотов. В целом 16 веке в стране был архитекторский бум. Шамборский замок в стиле Ренессанса по проекту Леонардо да Винчи был
				возведен именно тогда. После нас хоть потоп, так говорил Людовик 14. Он сделал страну абсолютной монархии,
				правил с 1643 до 1715 года. Его жена Мариа Антуанета известна нам как одна из самых раскрепощённых королев. Версаль становится
				резиденцией королей. Людовик 14 построил знаменитый оперный театр, Академию живописи, науки, архитектуры и музыки, построил
				монументальный собор св. Репараты и известный всему миру Елисейские поля. Но после его смерти у страны остались огромные долги.
				Людовик был так занят самим собой, что страной правили его фаворитки, коррупция достигла своего апогея. После него страной правит
				Людовик 15, который тяжело заболев построил церковь Св. Женевьевы. Виктора Гюго, Жана-Жака Руссо, Вольтер, Суфло, Эмиля Золя и
				многие другие важные люди для Франции захоронены в этом пантеоне.
				<h3>Революций</h3>
				Когда правил Людовик 16 со штурма Бастилии в стране произошла революция, которая распространилась по всему миру. В 1792 году
				Франция становится республикой. Именно во времена революции была изобретена гильотина. После множество лет террора, когда революция
				казнит на гильотине своих руководителей, приходит звездный час Напалеона Бонапарта.
				<h3>Генерал Наполеон Бонапарт</h3>
				После коронации в Нотр-Даме, Напалеон провозглашает себя императором. Что бы увековечить победы французской армии, он как древние
				римляне, строит Триумфальную арку. Наполеон известен миру как величайший стратег, политик и завоеватель. Историки говорят, что его
				единственной ошибкой было нападение на Россию. В 1813 году после поражение, Напалеона изгнали на остров Эльба. После этого сенат
				провозглашает восстановление монархии Бурбонов. Но в стране не были довольны этим, что помогло Наполеону вернуться на родину.
				Правил он только 100 дней. После того, как Франция потерпела поражение в Ватерлоо, Бонапарта изгнали на более далеки остров Елены.
				<h3>Новое время</h3>
				В конце 19-го века Франция становится республикой в результате чего избирается новый президент. В конце 19-го века в стране
				проходит всемирная выставка, по этой же причине сегодня у мира есть Эйфелевая башня, против которого выступала богема французской
				культуры, а Ги де Мопасан всегда завтракал в местах где не была видна Эйфелевая башня. В эти же времена Франция занимало вторе
				место по количеству колонии, уступая лишь Англии, половина африки была завоевана ими. Благодаря чему сегодня французски язык один
				из самых распространенных. После двух мировых войн, где Франция воевала на первых рядах и несла большие человеческие и материальные
				убытки, страна стала на ноги и сегодня одна из ведущих государств мира с мощной экономикой. Трудно приставит современный мир без
				французской культуры, ибо культура это во истину мировая. В страну ежегодно приезжают миллионы туристов для посещения красивых и
				исторических монументов. А Лувр на сегодня принимает больше всех посетителей среди всех музеев мира. Не стоит забивать, что именно
				Франция импортировала в остальной мир революционные действия и Эпоху Просвещения, благодаря чему в мире сегодня есть такие
				понятия как свобода слова, вероисповедания и другие либерально-демократические понятия.
      </section>
		)
	}
}
