import React, { Component } from 'react';

import './russia.css'

export default class Russia extends Component {

	render() {
		return (
			<section className='russia'>
        <h2>Краткая история России</h2>
        Древнейшие следы обитания человека на территории России обнаружены в Сибири, на Северном Кавказе
        и в Прикубанье и относятся к периоду примерно 3—2 млн лет до нашей эры. В VI—V веках до н. э. на
        черноморском побережье возникают греческие колонии, впоследствии превратившиеся в Скифское и Боспорское царства.
        <h3>Славяне и их соседи</h3>
        К V веку н.э. славянские племена занимают земли на берегах Балтийского моря, по Днепру и по Дунаю, и в верховьях
        Оки и Волги. Помимо охоты славяне занимаются земледелием, постепенно развивается торговля. Главными торговыми путями
        являются реки. К IX веку образовалось несколько славянских княжеств, главными из них были Киев и Новгород.
        <h3>Русское государство</h3>
        В 882 году новгородский князь Олег захватывает Киев, и, объединив славянский север и юг, создаёт Древнерусское
        государство. С Киевской Русью считаются и в Византии, и в соседних западных государствах. При преемнике Олега Игоре,
        сыне Рюрика, заключается договор с Византией о защите её границ от кочевников. В 988 году при князе Владимире происходит
        Крещение языческой Руси. Принятие православия укрепляет связи с Византией, вместе с новой верой среди славян распространяется
        греческая культура, науки и искусство. На Руси используют новую славянскую азбуку, пишутся летописи. При князе Ярославе Мудром
        составляется первый свод законов Киевского государства — «Русская Правда». С 30-х гг XII вв начинается дробление объединённого
        государства на ряд самостоятельных княжеств.
        <h3>Иго</h3>
        С начала XIII в огромная армия Чингиз-хана Темучина опустошает Азию и Закавказье. Покорив и обложив данью народы Кавказа,
        монгольская армия впервые появляется и в русской истории, разгромив в 1223 году соединённые силы славянских князей и половцев
        на реке Калке. Через 13 лет внук Чингис-хана Батый приходит на Русь с востока и поодиночке разбивает войска русских князей,
        в 1240 году берёт Киев, идёт на Западную Европу и, вернувшись, основывает низовьях Волги своё государство — Золотую Орду,
        а русские земли облагает данью. Отныне князья получают власть над своими землями только с санкции ханов Золотой Орды. Этот
        период вошёл в российскую историю как монголо-татарское иго.
        <h3>Великое княжество Московское</h3>
        С начала XIV века во многом стараниями Ивана Калиты и его наследников постепенно формируется новый центр русских княжеств – Москва.
        К концу XIV века Москва окрепла настолько, чтобы открыто выступить против Орды. В 1380 г. князь Димитрий разбивает войско хана Мамая
        на Куликовом поле. При Иване III Москва перестаёт платить дань Орде: хан Ахмат в ходе «стояния на реке Угре» в 1480 году, не решается
        на битву и отступает. Монголо-татарское иго завершается.
        <h3>Время Ивана Грозного</h3>
        При Иване IV Грозном, (официально первый русский царь с 1547 г.), активно ведётся собирание земель, потерянных в результате татаро-монгольского
        ига и польско-литовской экспансии, проводится также политика дальнейшего расширения государственных границ. В состав Русского государства
        включены Казанское, Астраханское и Сибирское ханства. В конце XVI — середине XVII веков, с сильным опозданием по сравнению со странами
        Центральной Европы, оформляется крепостное право. В 1571 году Москва была сожжена войском крымского хана Девлет-Гирея. В следующем 1572
        году 120-тысячное крымско-турецкое войско, шедшее на Русь, было уничтожено, что фактически поставило точку в многовековой борьбе Руси со
        степью.
        <h3>Смутное время и первые Романовы</h3>
        Со смертью в 1598 г. сына Ивана Грозного Федора династия Рюриковичей прерывается. Начинается Смутное время, время борьбы за престол и
        польско-шведской интервенции. Завершается Смута созывом всенародного ополчения, изгнанием поляков и избранием на царство Михаила Фёдоровича,
        первого представителя династии Романовых (21 февраля 1613 года). В его царствование русские экспедиции начинают освоение Восточной
        Сибири, Россия выходит к Тихому океану. В 1654 году в состав Российского государства на правах автономии входит Украина. При Алексее
        Михайловиче усиливается влияние Запада.
        <h3>Российская империя</h3>
        Царь Пётр I радикально реформирует Русское государство, установив абсолютную монархию во главе с императором, которому подчиняется
        даже церковь. Боярство превращается в дворянство. Модернизируется армия и система образования, многое устраивается по западному образцу.
        В результате Северной войны России возвращены русские земли, захваченные Швецией в конце XVI века. В устье Невы основан город-порт
        Санкт-Петербург, куда в 1712 году переносится столица России. При Петре выходит первая в России газета «Ведомости» и вводится с 1
        января 1700 года новый календарь, где новый год начинается с января (до этого год отсчитывался с первого сентября).
        После Петра I начинается Эпоха дворцовых переворотов, время дворянских заговоров и частых свержений неугодных императоров. Дольше
        других царствуют Анна Ивановна и Елизавета Петровна. При Елизавете Петровне был основан Московский университет. При императрице
        Екатерине Великой начинается освоение Америки, Россия отвоёвывает у Турции выход к Чёрному морю.
        <h3>Наполеоновские войны</h3>
        В 1805 году Александр I вступает в войну с Наполеоном I, объявившим себя императором Франции. Наполеон одерживает победу, одно из
        условий мирного соглашения – прекращение торговли с Англией, на что Александру I приходится согласиться. В 1809 Россия захватывает
        принадлежавшую шведам Финляндию, которая входит в состав Российской империи. Спустя несколько лет Россия возобновляет торговлю с
        Англией, и летом 1812 года Наполеон с армией более чем в 500 тысяч человек вторгается в Россию. Уступающая в числе более чем в два
        раза русская армия отступает к Москве. На борьбу с захватчиками поднимается народ, возникают многочисленные партизанские отряды,
        война 1812 г. получает название Отечественной. В конце августа под Москвой у села Бородино произошло крупнейшее сражение войны.
        Потери с обеих сторон были огромны, но численный перевес оставался на стороне французов. Глава русской армии фельдмаршал Михаил
        Кутузов решает сдать Москву Наполеону без боя и отступить, чтобы сохранить армию. Москва, занятая французами, почти полностью
        уничтожена пожарами. При отступлении к границам России армия Наполеона постепенно тает, русские преследует отступающих французов,
        и в 1814 году русская армия входит в Париж.
        <h3>Возникновение гражданского общества</h3>
        В XIX веке под влиянием либеральных идей Запада возникает устойчивая разночинная группа образованных людей, сама создающая либеральные
        и демократические ценности, впоследствии названная интеллигенцией. Наиболее известными её представителями были Белинский, Чернышевский,
        Добролюбов. После окончания войны проникшие в Россию революционные идеи выливаются в 1825 году в неудавшееся Восстание декабристов.
        Опасаясь новых восстаний, государство ужесточает контроль над политической, экономической и культурной жизнью страны.
        В ходе длительных войн с горцами в первой половине XIX столетия Россия присоединяет Кавказ, и – частично мирным, частично военным
        путём – территории Средней Азии (Бухарское и Хивинского ханства, Казахские жузы).
        <h3>2-я половина XIX века</h3>
        В 1861 году при императоре Александре II в России было отменено крепостное право. Был также проведён ряд либеральных реформ, ускоривший модернизацию страны.
        <h3>Конец XIX — начало XX века</h3>
        В конце 19 – начале 20 в. Россия активно осваивает Дальний Восток, что вызывает беспокойство Японии, правительство Российской империи считает, что «маленькая победоносная война» на фоне роста революционных настроений позволит улучшить внутреннюю ситуацию. Япония, однако, упреждающим ударом разгромила часть русских кораблей, отсутствие современного технического оснащения российской армии и некомпетентность высшего офицерского состава довершает поражение России в войне. Положение России на международной арене оказывается крайне сложным.
        В 1914 году Россия вступает в Первую мировую войну. Февральская революция 1917 года положила конец монархии: царь Николай II отрекается от престола, власть переходит к Временному правительству. В сентябре 1917 года Российская империя преобразуется в Российскую республику.
        <h3>Советское государство</h3>
        Однако и после революции восстановить порядок в стране не удаётся, воспользовавшись политическим хаосом, власть захватывает большевистская
        партия под руководством Владимира Ленина, в союзе с левыми эсерами и анархистами. После Октябрьской революции 25 октября (7 ноября)
        1917 года в стране провозглашена Российская Советская Республика. Советская республика начинает ликвидацию частной собственности и
        её национализацию. В стремлении установить контроль большевики не чуждаются крайних мер, подвергая репрессиям религию, казачество и
        другие формы организации общества. Заключённый с Германией мир стоил Советскому государству Украины, Прибалтики, Польши, части
        Белоруссии и 90 тонн золота, и послужил одной из причин гражданской войны. В марте 1918 г Советское правительство переезжает из
        Петрограда в Москву, опасаясь захвата города немцами. В ночь с 16 на 17 июля 1918 года в Екатеринбурге расстреляна царская семья,
        тела сброшены в шахту обвалившегося рудника.
        <h3>Гражданская война</h3>
        В течение 1918—1922 годов сторонники большевиков ведут боевые действия против их противников. В ходе войны из состава России выходит
        Польша, прибалтийские республики (Литва, Латвия, Эстония) и Финляндия.
        <h3>СССР, 1920—1930-е годы</h3>
        30 декабря 1922 года образуется Союз Советских Социалистических Республик (Россия, Украина, Белоруссия, Закавказская Федерация).
        В 1921—1929 годах проводится Новая экономическая политика (НЭП). Победителем во внутриполитической борьбе, разгоревшейся после
        смерти Ленина в 1924 г., становится Иосиф Сталин (Джугашвили). В 1930-х годах Сталиным проводится «чистка» партийного аппарата.
        Создаётся система исправительно-трудовых лагерей (ГУЛаг). В 1939—1940 годах к СССР присоединены Западная Белоруссия, Западная
        Украина, Молдавия, Западная Карелия, Прибалтика.
        Великая Отечественная война 22 июня 1941 года внезапным нападением нацистской Германии началась Великая Отечественная война.
        За сравнительно короткое время немецкие войска смогли продвинуться далеко вглубь советского государства, но так и не смогли
        овладеть Москвой и Ленинградом, в результате чего война, вместо запланированного Гитлером блицкрига, превратилась в затяжную.
        Битвы под Сталинградом и Курском переломили ход войны, и советские войска перешли в стратегическое наступление. Война завершилась
        взятием Берлина в мае 1945 года и капитуляцией Германии. Количество погибших в ходе военных действий и в результате оккупации в
        СССР достигает по подсчётам историков 26 млн человек.
        <h3>Советско-японская война</h3>
        В результате войны с Японией в 1945 году в состав России вошли Южный Сахалин и Курильские острова.
        <h3>Холодная война и застой</h3>
        В результате войны страны Восточной Европы (Венгрия, Польша, Румыния, Болгария, Чехословакия, ГДР) попали в советскую зону влияния.
        Отношения с Западом резко обостряются. Начинается так называемая холодная война – противостояние между Западом и странами соцлагеря,
        достигшее пика в 1962 году, когда между СССР и США чуть было не разразилась ядерная война (Карибский кризис). Потом накал конфликта
        постепенно идёт на спад, в отношениях с Западом наметился определённый прогресс, в частности, подписывается договор об экономическом
        сотрудничестве с Францией. В 70-е годы ослабляется конфронтация СССР и США. Заключаются договоры об ограничении стратегических
        ядерных вооружений (ОСВ-1 и ОСВ-2). Вторую половину 70-х гг называют «эпохой застоя», когда, при относительной стабильности, СССР
        постепенно отстаёт от передовых стран Запада в технологическом плане.
        <h3>Перестройка и распад СССР</h3>
        С приходом к власти Михаила Горбачёва в 1985 году в СССР объявляется политика перестройки, с целью решить проблемы в социальной
        сфере и общественном производстве, а также избегнуть надвигающегося экономического кризиса, вызванного гонкой вооружений. Однако
        эта политика приводит к усугублению кризиса, распаду СССР и переходу к капитализму. В 1991 году создаётся Содружество Независимых
        Государств (СНГ), куда входят РСФСР, Украина и Белоруссия
      </section>
		)
	}
}
