import React, { Component } from 'react';

import './britain.css'

export default class Britain extends Component {

	render() {
		return (
			<section className='britain'>
        <h2>Краткая история Великобритании</h2>
				Великобритания – страна с древней, сложной и интересной историей, изучение которой может занять годы и даже целую жизнь.
				Тем, кто учит английский язык, важно иметь общее представление о становлении и развитии родины этого языка. Поэтому мы
				рекомендуем познакомиться с краткой историей Великобритании. Это будет поверхностное изложение, но оно поможет составить
				общую картину и, может быть, мотивирует на более глубокое изучение заинтересовавших вас событий.
				<h3>Доисторический период</h3>
				Территория Великобритании стала заселяться людьми во времена палеолита около 700 тысяч лет назад, когда на Земле царил
				ледниковый период, а пролива между Британскими островами и Европой не существовало. В 6500 году до нашей эры Британию
				окончательно отрезало от континента. Климат к тому времени улучшился, люди начали возделывать землю и выращивать животных.
				Примерно в 4000 году до нашей эры доисторические жители Британских островов построили Стоунхендж. В 800-700 годах до нашей эры
				на территорию Великобритании стали переселяться племена кельтов, до этого жившие в Западной и Центральной Европе. В античную
				эпоху британских кельтов стали называть бриттами, откуда позже появятся названия Британия и Великобритания.
				<h3>Римское завоевание</h3>
				В 1 веке до нашей эры Юлий Цезарь начал завоевательные походы на Британию. К концу 60-х годов территория бриттов была покорена,
				а Британия стала провинцией Римской империи. Местное население было воинственным, но слабым по сравнению с римлянами. Бритты
				регулярно поднимали восстания, но их быстро подавляли. Одно из самых известных кельтских восстаний организовала жена вождя
				племени иценов по имени Боудикка.
				<h3>Англосаксонская эпоха и набеги викингов</h3>
				Когда римляне покинули Британию, ее стали завоевывать пришедшие с континента племена англов, саксов и ютов. От них произошли
				современные англичане, тогда как шотландцы, ирландцы и валлийцы – потомки кельтов. Англосаксонские племена основали в Британии
				семь крупных королевств, которые затем объединились в единое королевство под названием Англия. Первым королем Англии стал Альфред
				Великий. Когда в конце 8 века на Англию стали нападать викинги – племя данов, Альфред не сумел защитить свою страну и ушел в
				изгнание. Местные жители, которые раньше были недовольны суровым правлением короля, теперь хотели, чтобы он вернулся и избавил
				страну от викингов. Король собрал партизанский отряд и начал совершать набеги на завоевателей. Чтобы выведать больше информации
				о лагере викингов, он даже проник в него, переодетый странствующим музыкантом, и развлекал своих врагов саксонскими песнями.
				Альфред одержал несколько побед над данами и вынудил их заключить мир. По соглашению, между владениями английского короля и
				завоеванными землями викингов проходила четкая граница. Области, подвластные данам, стали известны как Данелаг: туда входил Эссекс
				вместе с Лондоном, Нортумбрия, Кембриджшир, Восточная Англия и другие регионы. 1018 году Данелаг окончательно вошел в состав
				Англии. Но датское правление значительно сказалось на последующей истории этого региона, который еще долго сохранял историческое,
				этническое, правовое и социальное своеобразие.
				<h3>Присоединение Шотландии и начало Ганноверской династии</h3>
				После Вильгельма Оранского королевой стала Анна – младшая дочь Карла II. В 1707 году она подписала Акт об унии, в результате
				которого Англия объединилась с Шотландией и образовала новое государство – Великобританию. Уэльс в те времена входил в состав
				Англии и закономерно стал частью новой страны. Анна была бездетной, и после нее трон занял курфюрст Ганноверский Георг, правнук
				Якова I. Он стал первым представителем династии Ганноверов на английском троне.
				<h3>Викторианская эпоха</h3>
				После смерти Георга IV власть перешла к его младшему брату Вильгельму IV. Он процарствовал всего семь лет и умер, не оставив
				наследников – законные дети умерли еще в детстве. В 1837 году королевой стала его племянница Виктория, дочь принца Кентского
				Эдуарда, который приходился четвертым сыном безумного короля Георга III. Виктория взошла на трон в возрасте 18 лет. К тому
				времени Великобритания превратилась в конституционную монархию с ограниченной властью короля. Тем не менее, королева оказала
				огромное влияние на развитие страны, умело управляя правительством и контролируя назначение министров. При этом ее власть
				оставалась символической. Королева Виктория стала одним из национальных символов Великобритании. В викторианскую эпоху
				Великобритания переживала расцвет по всех областях – политической, культурной, промышленной, научной и военной. В правление
				Виктории Индия стала частью Британской империи, был присоединен Кипр, Англия получила большинство акций Суэцкого канала и
				заняла важное положение в Египте. В целом этот период был относительно мирным. В викторианскую эпоху зародился английский
				средний класс, сформировался знаменитый образ джентльмена и кодекс чести. В городах Великобритании появились освещение,
				тротуары, водопровод, канализация, метро. Страна стала финансовой столицей мира. Виктория придерживалась строгих моральных
				принципов. В 1840 году она вышла замуж по любви за саксонского принца Альберта, впоследствии родив девять детей, которые
				укрепили связи между европейскими династиями. Королеву даже называли «Бабушкой Европы». После смерти мужа в 1861 году
				Виктория беспрерывно носила траур и не появлялась на публике. Королева Виктория пробыла на троне дольше всех своих
				предшественников – 63 года. Этот рекорд удалось побить только современной британской королеве Елизавете II, которая
				правит уже 66 лет.
      </section>
		)
	}
}
